#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
module.repository["cla-bot"].github_repository.repository: Refreshing state... [id=cla-bot]
module.repository_rust_svc["storage"].data.github_team.owner: Reading...
module.repository["website"].github_repository.repository: Refreshing state... [id=website]
module.repository_tf["onboarding"].github_repository.repository: Refreshing state... [id=tf-onboarding]
module.repository_rust_lib["router"].data.github_team.owner: Reading...
module.repository_rust_svc["scheduler"].data.github_team.owner: Reading...
module.repository_lib_template["rust"].data.github_team.owner: Reading...
module.repository["clabot-config"].github_repository.repository: Refreshing state... [id=clabot-config]
module.repository["tools"].github_repository.repository: Refreshing state... [id=tools]
module.repository_svc_template["typescript"].data.github_team.owner: Reading...
module.repository_tf["onboarding"].data.github_team.owner: Reading...
module.repository["cla-bot"].data.github_team.owner: Reading...
module.repository_tf["github"].github_repository.repository: Refreshing state... [id=tf-github]
module.repository["clabot-config"].data.github_team.owner: Reading...
module.repository["tools"].data.github_team.owner: Reading...
module.repository_svc_template["python"].data.github_team.owner: Reading...
module.repository_rust_lib["router"].data.github_team.owner: Read complete after 5s [id=6311795]
module.repository_svc_template["rust"].data.github_team.owner: Reading...
module.repository_rust_svc["storage"].data.github_team.owner: Read complete after 6s [id=6311795]
module.repository["website"].data.github_team.owner: Reading...
module.repository_svc_template["typescript"].data.github_team.owner: Read complete after 7s [id=6311795]
module.repository_tf["github"].data.github_team.owner: Reading...
module.repository_rust_svc["scheduler"].data.github_team.owner: Read complete after 9s [id=6311795]
module.repository_lib_template["rust"].github_repository.repository: Refreshing state... [id=template-rust-lib]
module.repository_lib_template["rust"].data.github_team.owner: Read complete after 9s [id=6311795]
module.repository_svc_template["rust"].github_repository.repository: Refreshing state... [id=svc-template-rust]
module.repository_tf["onboarding"].data.github_team.owner: Still reading... [10s elapsed]
module.repository_tf["onboarding"].data.github_team.owner: Read complete after 10s [id=6029505]
module.repository_svc_template["typescript"].github_repository.repository: Refreshing state... [id=svc-template-typescript]
module.repository["cla-bot"].data.github_team.owner: Still reading... [10s elapsed]
module.repository["cla-bot"].data.github_team.owner: Read complete after 10s [id=6029505]
module.repository_svc_template["python"].github_repository.repository: Refreshing state... [id=svc-template-python]
module.repository["website"].github_branch.branch["staging"]: Refreshing state... [id=website:staging]
module.repository_tf["onboarding"].github_repository_webhook.map["discord"]: Refreshing state... [id=372087608]
module.repository["clabot-config"].data.github_team.owner: Still reading... [10s elapsed]
module.repository["clabot-config"].data.github_team.owner: Read complete after 10s [id=6029505]
module.repository_tf["github"].github_repository_webhook.map["discord"]: Refreshing state... [id=372087606]
module.repository["tools"].data.github_team.owner: Still reading... [10s elapsed]
module.repository["tools"].data.github_team.owner: Read complete after 10s [id=6203057]
module.repository_lib_template["rust"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:template-rust-lib]
module.repository_tf["onboarding"].github_branch_default.default: Refreshing state... [id=tf-onboarding]
module.repository_tf["github"].github_branch_default.default: Refreshing state... [id=tf-github]
module.repository_svc_template["python"].data.github_team.owner: Still reading... [10s elapsed]
module.repository_svc_template["python"].data.github_team.owner: Read complete after 10s [id=6311795]
module.repository_rust_lib["router"].github_repository.repository: Refreshing state... [id=lib-router]
module.repository_svc_template["rust"].data.github_team.owner: Still reading... [10s elapsed]
module.repository_svc_template["rust"].data.github_team.owner: Read complete after 10s [id=6311795]
module.repository_svc_template["rust"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-template-rust]
module.repository_svc_template["typescript"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-template-typescript]
module.repository_svc_template["python"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-template-python]
module.repository_rust_svc["storage"].github_repository.repository: Refreshing state... [id=svc-storage]
module.repository_rust_svc["scheduler"].github_repository.repository: Refreshing state... [id=svc-scheduler]
module.repository["clabot-config"].github_branch_default.default: Refreshing state... [id=clabot-config]
module.repository["website"].data.github_team.owner: Still reading... [10s elapsed]
module.repository["website"].data.github_team.owner: Read complete after 10s [id=5490296]
module.repository["tools"].github_branch_default.default: Refreshing state... [id=tools]
module.repository["website"].github_branch_default.default: Refreshing state... [id=website]
module.repository["cla-bot"].github_branch_default.default: Refreshing state... [id=cla-bot]
module.repository_tf["github"].data.github_team.owner: Read complete after 10s [id=6029505]
module.repository["cla-bot"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:cla-bot]
module.repository["clabot-config"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:clabot-config]
module.repository["tools"].github_team_repository.maintainer["drone-engineering"]: Refreshing state... [id=6203057:tools]
module.repository["website"].github_team_repository.maintainer["webdevelopers"]: Refreshing state... [id=5490296:website]
module.repository_rust_lib["router"].github_repository_webhook.map["discord"]: Refreshing state... [id=372953444]
module.repository_rust_lib["router"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:lib-router]
module.repository_rust_lib["router"].github_branch.branch["develop"]: Refreshing state... [id=lib-router:develop]
module.repository_tf["onboarding"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:tf-onboarding]
module.repository_tf["onboarding"].github_repository_file.CODEOWNERS: Refreshing state... [id=tf-onboarding/.github/CODEOWNERS]
module.repository_tf["github"].github_repository_file.CODEOWNERS: Refreshing state... [id=tf-github/.github/CODEOWNERS]
module.repository_tf["github"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:tf-github]
module.repository_tf["github"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:tf-github]
module.repository_rust_svc["storage"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-storage]
module.repository_rust_svc["storage"].github_repository_webhook.map["discord"]: Refreshing state... [id=372953439]
module.repository_rust_svc["storage"].github_branch.branch["develop"]: Refreshing state... [id=svc-storage:develop]
module.repository_rust_svc["scheduler"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-scheduler]
module.repository_rust_svc["scheduler"].github_repository_webhook.map["discord"]: Refreshing state... [id=372953430]
module.repository_rust_svc["scheduler"].github_branch.branch["develop"]: Refreshing state... [id=svc-scheduler:develop]
module.repository["clabot-config"].github_repository_file.CODEOWNERS: Refreshing state... [id=clabot-config/.github/CODEOWNERS]
module.repository["tools"].github_repository_file.CODEOWNERS: Refreshing state... [id=tools/.github/CODEOWNERS]
module.repository["website"].github_repository_file.CODEOWNERS: Refreshing state... [id=website/.github/CODEOWNERS]
module.repository["cla-bot"].github_repository_file.CODEOWNERS: Refreshing state... [id=cla-bot/.github/CODEOWNERS]
module.repository_rust_lib["router"].github_branch_default.default: Refreshing state... [id=lib-router]
module.repository_rust_svc["storage"].github_branch_default.default: Refreshing state... [id=svc-storage]
module.repository_rust_svc["scheduler"].github_branch_default.default: Refreshing state... [id=svc-scheduler]
module.repository_rust_lib["router"].github_repository_file.CODEOWNERS: Refreshing state... [id=lib-router/.github/CODEOWNERS]
module.repository_rust_lib["router"].github_repository_file.files[".github/workflows/editorconfig_check.yml"]: Refreshing state... [id=lib-router/.github/workflows/editorconfig_check.yml]
module.repository_rust_lib["router"].github_repository_file.files[".gitignore"]: Refreshing state... [id=lib-router/.gitignore]
module.repository_rust_lib["router"].github_repository_file.files[".github/workflows/python_ci.yml"]: Refreshing state... [id=lib-router/.github/workflows/python_ci.yml]
module.repository_rust_lib["router"].github_repository_file.files[".cargo-husky/hooks/README.md"]: Refreshing state... [id=lib-router/.cargo-husky/hooks/README.md]
module.repository_rust_lib["router"].github_repository_file.files[".github/workflows/rust_ci.yml"]: Refreshing state... [id=lib-router/.github/workflows/rust_ci.yml]
module.repository_rust_lib["router"].github_repository_file.files[".cargo-husky/hooks/pre-push"]: Refreshing state... [id=lib-router/.cargo-husky/hooks/pre-push]
module.repository_rust_lib["router"].github_repository_file.files[".cargo-husky/hooks/pre-commit"]: Refreshing state... [id=lib-router/.cargo-husky/hooks/pre-commit]
module.repository_rust_lib["router"].github_repository_file.files[".cargo/config.toml"]: Refreshing state... [id=lib-router/.cargo/config.toml]
module.repository_rust_lib["router"].github_repository_file.files[".editorconfig"]: Refreshing state... [id=lib-router/.editorconfig]
module.repository_rust_svc["storage"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-storage/.github/CODEOWNERS]
module.repository_rust_svc["storage"].github_repository_file.files[".cargo-husky/hooks/pre-push"]: Refreshing state... [id=svc-storage/.cargo-husky/hooks/pre-push]
module.repository_rust_svc["storage"].github_repository_file.files[".github/workflows/editorconfig_check.yml"]: Refreshing state... [id=svc-storage/.github/workflows/editorconfig_check.yml]
module.repository_rust_svc["storage"].github_repository_file.files[".github/workflows/python_ci.yml"]: Refreshing state... [id=svc-storage/.github/workflows/python_ci.yml]
module.repository_rust_svc["storage"].github_repository_file.files[".cargo-husky/hooks/README.md"]: Refreshing state... [id=svc-storage/.cargo-husky/hooks/README.md]
module.repository_rust_svc["storage"].github_repository_file.files[".editorconfig"]: Refreshing state... [id=svc-storage/.editorconfig]
module.repository_rust_svc["storage"].github_repository_file.files[".cargo-husky/hooks/pre-commit"]: Refreshing state... [id=svc-storage/.cargo-husky/hooks/pre-commit]
module.repository_rust_svc["storage"].github_repository_file.files[".cargo/config.toml"]: Refreshing state... [id=svc-storage/.cargo/config.toml]
module.repository_rust_svc["storage"].github_repository_file.files[".github/workflows/rust_ci.yml"]: Refreshing state... [id=svc-storage/.github/workflows/rust_ci.yml]
module.repository_rust_svc["storage"].github_repository_file.files[".gitignore"]: Refreshing state... [id=svc-storage/.gitignore]
module.repository_rust_svc["scheduler"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-scheduler/.github/CODEOWNERS]
module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo-husky/hooks/pre-commit"]: Refreshing state... [id=svc-scheduler/.cargo-husky/hooks/pre-commit]
module.repository_rust_svc["scheduler"].github_repository_file.files[".gitignore"]: Refreshing state... [id=svc-scheduler/.gitignore]
module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo/config.toml"]: Refreshing state... [id=svc-scheduler/.cargo/config.toml]
module.repository_rust_svc["scheduler"].github_repository_file.files[".editorconfig"]: Refreshing state... [id=svc-scheduler/.editorconfig]
module.repository_rust_svc["scheduler"].github_repository_file.files[".github/workflows/editorconfig_check.yml"]: Refreshing state... [id=svc-scheduler/.github/workflows/editorconfig_check.yml]
module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo-husky/hooks/README.md"]: Refreshing state... [id=svc-scheduler/.cargo-husky/hooks/README.md]
module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo-husky/hooks/pre-push"]: Refreshing state... [id=svc-scheduler/.cargo-husky/hooks/pre-push]
module.repository_rust_svc["scheduler"].github_repository_file.files[".github/workflows/python_ci.yml"]: Refreshing state... [id=svc-scheduler/.github/workflows/python_ci.yml]
module.repository_rust_svc["scheduler"].github_repository_file.files[".github/workflows/rust_ci.yml"]: Refreshing state... [id=svc-scheduler/.github/workflows/rust_ci.yml]
module.repository_tf["github"].github_branch_protection.all["tf-github"]: Refreshing state... [id=BPR_kwDOG6VIns4BpnEQ]
module.repository_tf["github"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOG6VIns4BpLGe]
module.repository["website"].github_branch_protection.all["website"]: Refreshing state... [id=BPR_kwDOGdyvzM4BpnEJ]
module.repository["website"].github_branch_protection.protection["staging"]: Refreshing state... [id=BPR_kwDOGdyvzM4BiRcL]
module.repository["website"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOGdyvzM4BiRcN]
module.repository["cla-bot"].github_branch_protection.all["cla-bot"]: Refreshing state... [id=BPR_kwDOHTAbhc4BpnEE]
module.repository["tools"].github_branch_protection.all["tools"]: Refreshing state... [id=BPR_kwDOHn-Jf84BpnEA]
module.repository["cla-bot"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHTAbhc4BmmRb]
module.repository["tools"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHn-Jf84BmmRe]
module.repository_rust_lib["router"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHyi9o84Bqidv]
module.repository_rust_lib["router"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHyi9o84Bqid1]
module.repository_rust_lib["router"].github_branch_protection.all["lib-router"]: Refreshing state... [id=BPR_kwDOHyi9o84BqieE]
module.repository_rust_svc["scheduler"].github_branch_protection.all["svc-scheduler"]: Refreshing state... [id=BPR_kwDOHyi9hc4Bqidq]
module.repository_rust_svc["storage"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHyi9jc4BqieG]
module.repository_rust_svc["storage"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHyi9jc4BqieF]
module.repository_rust_svc["storage"].github_branch_protection.all["svc-storage"]: Refreshing state... [id=BPR_kwDOHyi9jc4BqieI]
module.repository_rust_svc["scheduler"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHyi9hc4Bqidr]
module.repository_rust_svc["scheduler"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHyi9hc4Bqidt]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repository["website"].github_branch.branch["staging"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"1dfb325e4dec1b377b2618928c65504a6f416cf0284d08250544a7299dd7f00a\"" -> "W/\"d039f2b2cb1539381ac7ee32a412d309d75b7084db7a09c453a65d6698cb7cdb\""
        id            = "website:staging"
      ~ sha           = "29e8d7529228eda1ed8f3995052c5e690d313b11" -> "d58ffe9f3da8185793335be51158940a4334564f"
        # (4 unchanged attributes hidden)
    }

  # module.repository_rust_lib["router"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"5d2326acd25d1b5a5f12f18ff5966723fc18fa16407ba43bc78f5b06013be00f\"" -> "W/\"61839288545c0d8e1d057904cd67b7cdc521c6cacf02b4d8cad330e090bfc26b\""
        id            = "lib-router:develop"
      ~ sha           = "f40463da469fd5c8beabcba243bb01e93881b177" -> "baa27f86f9fa11574a3940755e71d4f2d50a3a69"
        # (5 unchanged attributes hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"bba65cf26db3df7d06346aa95a0f98006b84b44e37aeb63458ef6f615a3ded20\"" -> "W/\"87af55c4bf08b7b5097767fb45e3b51aa6c316db754bcad6512e5c410adfaabb\""
        id            = "svc-scheduler:develop"
      ~ sha           = "c3a9244b48140f8d605414a8f93d510807adcb8b" -> "6e11d6426e2273f3582f01673f1106e08918e6e1"
        # (5 unchanged attributes hidden)
    }

  # module.repository_rust_svc["storage"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"9557d3b117af1a74d95c56c8157b7be47a6d27cfa6a2ea0060a9bb39c432c8a8\"" -> "W/\"2ed2d47c5358a0b6166b1d4fd528c9c71705c5a1a28954ad793819e62c0ee7bc\""
        id            = "svc-storage:develop"
      ~ sha           = "4f6636195e55914fbe8a963ef676ce3da71765ec" -> "18613a045f1c2d800c091804c85570f0ed738277"
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.repository["cla-bot"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHTAbhc4BmmRb"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tools"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-Jf84BmmRe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcN"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["staging"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcL"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_branch.branch["develop"] will be created
  + resource "github_branch" "branch" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "lib-template-rust"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repository_lib_template["rust"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + repository = "lib-template-rust"
    }

  # module.repository_lib_template["rust"].github_branch_protection.all["lib-template-rust"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "lib-template-rust"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "develop"
      + repository_id                   = "lib-template-rust"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "lib-template-rust"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_lib_template["rust"].github_repository.repository will be updated in-place
  # (moved from github_repository.lib_template_rust)
  ~ resource "github_repository" "repository" {
      ~ delete_branch_on_merge = false -> true
      ~ description            = "Arrow (Rust) Library Repository" -> "Arrow Library Template - Rust libraries"
        id                     = "template-rust-lib"
      ~ name                   = "template-rust-lib" -> "lib-template-rust"
        # (26 unchanged attributes hidden)
    }

  # module.repository_lib_template["rust"].github_repository_file.CODEOWNERS will be created
  + resource "github_repository_file" "CODEOWNERS" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/services
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-template-rust"
      + sha                 = (known after apply)
    }

  # module.repository_lib_template["rust"].github_repository_webhook.map["discord"] will be created
  + resource "github_repository_webhook" "map" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "pull_request",
          + "pull_request_review",
          + "pull_request_review_comment",
          + "pull_request_review_thread",
        ]
      + id         = (known after apply)
      + repository = "lib-template-rust"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # module.repository_lib_template["rust"].github_team_repository.maintainer["services"] must be replaced
  # (moved from github_team_repository.lib_template_rust_maintainer)
-/+ resource "github_team_repository" "maintainer" {
      ~ etag       = "W/\"047cb81aaaacaa137719e7e356e608c6d2e689401b1cfbc12c62d463d12f30c6\"" -> (known after apply)
      ~ id         = "6311795:template-rust-lib" -> (known after apply)
      ~ repository = "template-rust-lib" -> "lib-template-rust" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqidv"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqid1"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      ~ description            = "Arrow Libraries - Fleet Routing Algorithm Library" -> "Arrow Library - Fleet Routing Algorithm Library"
        id                     = "lib-router"
        name                   = "lib-router"
        # (26 unchanged attributes hidden)

      ~ template {
          ~ repository = "template-rust-lib" -> "lib-template-rust"
            # (1 unchanged attribute hidden)
        }
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidr"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidt"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      ~ description            = "Arrow Services - Fleet Routing and Flight Planner" -> "Arrow Service - Fleet Routing and Flight Planner"
        id                     = "svc-scheduler"
        name                   = "svc-scheduler"
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieG"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieF"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
      ~ description            = "Arrow Services - Storage module" -> "Arrow Service - Storage module"
        id                     = "svc-storage"
        name                   = "svc-storage"
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["python"].github_branch.branch["develop"] will be created
  + resource "github_branch" "branch" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "svc-template-python"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repository_svc_template["python"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + repository = "svc-template-python"
    }

  # module.repository_svc_template["python"].github_branch_protection.all["svc-template-python"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "svc-template-python"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "develop"
      + repository_id                   = "svc-template-python"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "svc-template-python"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_svc_template["python"].github_repository.repository will be updated in-place
  # (moved from github_repository.svc_template_python)
  ~ resource "github_repository" "repository" {
      ~ delete_branch_on_merge = false -> true
      ~ description            = "Arrow Service repository template for Python services" -> "Arrow Service Template - Python services"
        id                     = "svc-template-python"
        name                   = "svc-template-python"
        # (25 unchanged attributes hidden)
    }

  # module.repository_svc_template["python"].github_repository_file.CODEOWNERS will be created
  + resource "github_repository_file" "CODEOWNERS" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/services
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-template-python"
      + sha                 = (known after apply)
    }

  # module.repository_svc_template["python"].github_repository_webhook.map["discord"] will be created
  + resource "github_repository_webhook" "map" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "pull_request",
          + "pull_request_review",
          + "pull_request_review_comment",
          + "pull_request_review_thread",
        ]
      + id         = (known after apply)
      + repository = "svc-template-python"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_team_repository.svc_template_python_maintainer has moved to module.repository_svc_template["python"].github_team_repository.maintainer["services"]
    resource "github_team_repository" "maintainer" {
        id         = "6311795:svc-template-python"
        # (4 unchanged attributes hidden)
    }

  # module.repository_svc_template["rust"].github_branch.branch["develop"] will be created
  + resource "github_branch" "branch" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "svc-template-rust"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repository_svc_template["rust"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + repository = "svc-template-rust"
    }

  # module.repository_svc_template["rust"].github_branch_protection.all["svc-template-rust"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "svc-template-rust"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "develop"
      + repository_id                   = "svc-template-rust"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "svc-template-rust"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_svc_template["rust"].github_repository.repository will be updated in-place
  # (moved from github_repository.svc_template_rust)
  ~ resource "github_repository" "repository" {
      ~ delete_branch_on_merge = false -> true
      ~ description            = "Arrow Service repository template for Rust services" -> "Arrow Service Template - Rust services"
        id                     = "svc-template-rust"
        name                   = "svc-template-rust"
        # (26 unchanged attributes hidden)
    }

  # module.repository_svc_template["rust"].github_repository_file.CODEOWNERS will be created
  + resource "github_repository_file" "CODEOWNERS" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/services
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-template-rust"
      + sha                 = (known after apply)
    }

  # module.repository_svc_template["rust"].github_repository_webhook.map["discord"] will be created
  + resource "github_repository_webhook" "map" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "pull_request",
          + "pull_request_review",
          + "pull_request_review_comment",
          + "pull_request_review_thread",
        ]
      + id         = (known after apply)
      + repository = "svc-template-rust"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_team_repository.svc_template_rust_maintainer has moved to module.repository_svc_template["rust"].github_team_repository.maintainer["services"]
    resource "github_team_repository" "maintainer" {
        id         = "6311795:svc-template-rust"
        # (4 unchanged attributes hidden)
    }

  # module.repository_svc_template["typescript"].github_branch.branch["develop"] will be created
  + resource "github_branch" "branch" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "svc-template-typescript"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repository_svc_template["typescript"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + repository = "svc-template-typescript"
    }

  # module.repository_svc_template["typescript"].github_branch_protection.all["svc-template-typescript"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "svc-template-typescript"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "develop"
      + repository_id                   = "svc-template-typescript"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "svc-template-typescript"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_svc_template["typescript"].github_repository.repository will be updated in-place
  # (moved from github_repository.svc_template_typescript)
  ~ resource "github_repository" "repository" {
      ~ delete_branch_on_merge = false -> true
      ~ description            = "Arrow Service repository template for TypeScript services" -> "Arrow Service Template - TypeScript services"
        id                     = "svc-template-typescript"
        name                   = "svc-template-typescript"
        # (25 unchanged attributes hidden)
    }

  # module.repository_svc_template["typescript"].github_repository_file.CODEOWNERS will be created
  + resource "github_repository_file" "CODEOWNERS" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/services
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-template-typescript"
      + sha                 = (known after apply)
    }

  # module.repository_svc_template["typescript"].github_repository_webhook.map["discord"] will be created
  + resource "github_repository_webhook" "map" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "pull_request",
          + "pull_request_review",
          + "pull_request_review_comment",
          + "pull_request_review_thread",
        ]
      + id         = (known after apply)
      + repository = "svc-template-typescript"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_team_repository.svc_template_typescript_maintainer has moved to module.repository_svc_template["typescript"].github_team_repository.maintainer["services"]
    resource "github_team_repository" "maintainer" {
        id         = "6311795:svc-template-typescript"
        # (4 unchanged attributes hidden)
    }

  # module.tf_repository["github"].github_branch_default.default has moved to module.repository_tf["github"].github_branch_default.default
    resource "github_branch_default" "default" {
        id         = "tf-github"
        # (2 unchanged attributes hidden)
    }

  # module.tf_repository["github"].github_branch_protection.all["tf-github"] has moved to module.repository_tf["github"].github_branch_protection.all["tf-github"]
    resource "github_branch_protection" "all" {
        id                              = "BPR_kwDOG6VIns4BpnEQ"
        # (10 unchanged attributes hidden)
    }

  # module.repository_tf["github"].github_branch_protection.protection["main"] will be updated in-place
  # (moved from module.tf_repository["github"].github_branch_protection.protection["main"])
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOG6VIns4BpLGe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_tf["github"].github_repository.repository will be updated in-place
  # (moved from module.tf_repository["github"].github_repository.repository)
  ~ resource "github_repository" "repository" {
      ~ description            = "Terraform - github resources" -> "Arrow Terraform - github resources"
        id                     = "tf-github"
        name                   = "tf-github"
        # (27 unchanged attributes hidden)
    }

  # module.repository_tf["github"].github_repository_file.CODEOWNERS will be updated in-place
  # (moved from module.tf_repository["github"].github_repository_file.CODEOWNERS)
  ~ resource "github_repository_file" "CODEOWNERS" {
      ~ content             = <<-EOT
          - * @Arrow-air/services
          + * @Arrow-air/devops
        EOT
        id                  = "tf-github/.github/CODEOWNERS"
        # (9 unchanged attributes hidden)
    }

  # module.tf_repository["github"].github_repository_webhook.map["discord"] has moved to module.repository_tf["github"].github_repository_webhook.map["discord"]
    resource "github_repository_webhook" "map" {
        id         = "372087606"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.tf_repository["github"].github_team_repository.maintainer["devops"] has moved to module.repository_tf["github"].github_team_repository.maintainer["devops"]
    resource "github_team_repository" "maintainer" {
        id         = "6029505:tf-github"
        # (4 unchanged attributes hidden)
    }

  # module.tf_repository["github"].github_team_repository.maintainer["services"] has moved to module.repository_tf["github"].github_team_repository.maintainer["services"]
    resource "github_team_repository" "maintainer" {
        id         = "6311795:tf-github"
        # (4 unchanged attributes hidden)
    }

  # module.tf_repository["onboarding"].github_branch_default.default has moved to module.repository_tf["onboarding"].github_branch_default.default
    resource "github_branch_default" "default" {
        id         = "tf-onboarding"
        # (2 unchanged attributes hidden)
    }

  # module.repository_tf["onboarding"].github_repository.repository will be updated in-place
  # (moved from module.tf_repository["onboarding"].github_repository.repository)
  ~ resource "github_repository" "repository" {
      ~ description            = "Terraform - users and groups for resources manageable by Terraform" -> "Arrow Terraform - users and groups for resources manageable by Terraform"
        id                     = "tf-onboarding"
        name                   = "tf-onboarding"
        # (27 unchanged attributes hidden)
    }

  # module.tf_repository["onboarding"].github_repository_file.CODEOWNERS has moved to module.repository_tf["onboarding"].github_repository_file.CODEOWNERS
    resource "github_repository_file" "CODEOWNERS" {
        id                  = "tf-onboarding/.github/CODEOWNERS"
        # (10 unchanged attributes hidden)
    }

  # module.tf_repository["onboarding"].github_repository_webhook.map["discord"] has moved to module.repository_tf["onboarding"].github_repository_webhook.map["discord"]
    resource "github_repository_webhook" "map" {
        id         = "372087608"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.tf_repository["onboarding"].github_team_repository.maintainer["devops"] has moved to module.repository_tf["onboarding"].github_team_repository.maintainer["devops"]
    resource "github_team_repository" "maintainer" {
        id         = "6029505:tf-onboarding"
        # (4 unchanged attributes hidden)
    }

  # module.repository_tf["onboarding"].github_team_repository.maintainer["services"] will be created
  + resource "github_team_repository" "maintainer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "tf-onboarding"
      + team_id    = "services"
    }

Plan: 30 to add, 21 to change, 1 to destroy.

Changes to Outputs:
  ~ repositories = {
      ~ website       = {
          ~ branch         = {
              ~ staging = {
                  ~ etag          = "W/\"1dfb325e4dec1b377b2618928c65504a6f416cf0284d08250544a7299dd7f00a\"" -> "W/\"d039f2b2cb1539381ac7ee32a412d309d75b7084db7a09c453a65d6698cb7cdb\""
                    id            = "website:staging"
                  ~ sha           = "29e8d7529228eda1ed8f3995052c5e690d313b11" -> "d58ffe9f3da8185793335be51158940a4334564f"
                    # (5 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
        # (3 unchanged elements hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>
*Pusher: @owlot, Action: `pull_request`*